In [5]:
import pandas as pd

#Series method
#series=pd.Series([1,3,5,7,9])
print(series)

# series with index
series=pd.Series([1,3,5,7,9],index=['a','b','c','d','e'])
print(series)

0    1
1    3
2    5
3    7
4    9
dtype: int64
a    1
b    3
c    5
d    7
e    9
dtype: int64

In [9]:
#accessing series element
series=pd.Series([1,3,5,7,9],index=['a','b','c','d','e'])
print(series['a'])
print(series['e'])

1
9

In [11]:
# dataframe using list
data=pd.DataFrame([1,2,3,4,5])
print(data)

   0
0  1
1  2
2  3
3  4
4  5

In [1]:
# dataframe using dictionary
import pandas as pd
data1=pd.DataFrame({'name':['tom','jack','raj','martin'],
                   'age':[23,43,25,31]})
data1.head()

     name  age
0     tom   23
1    jack   43
2     raj   25
3  martin   31

In [13]:
data1=pd.DataFrame({'name':['tom','jack','raj','martin'],
                   'age':[23,43,25,31]},index=['C1','C2','C3','C4'])
data1.head(5)

      name  age
C1     tom   23
C2    jack   43
C3     raj   25
C4  martin   31

In [14]:
#coloumn selection
data1['name']
data1['age']

C1    23
C2    43
C3    25
C4    31
Name: age, dtype: int64

In [20]:
# row selection 
data1.loc['C3','age']
data1.iloc[3,1]

31

In [25]:
# pandas concatenation
names=pd.DataFrame({'Names':['tom','jack','raj','martin']})
ages=pd.DataFrame({'age':[23,43,25,31]})
names2=pd.DataFrame({'Names':['ram','amit','karan','yug']})
pd.concat([names,ages],axis=1)
pd.concat([names,names2],axis=0)

    Names
0     tom
1    jack
2     raj
3  martin
0     ram
1    amit
2   karan
3     yug

In [29]:
data1['name']
data1[['name','age']]

      name  age
C1     tom   23
C2    jack   43
C3     raj   25
C4  martin   31

In [31]:
data1[data1['age']>=18][['name']]

      name
C1     tom
C2    jack
C3     raj
C4  martin

In [32]:
data1.loc['C2','age']

43

In [35]:
data1.iloc[3,1]

31